### Report for gp2gp_dashboard on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 6.0"...
- Installing hashicorp/aws v6.30.0...
- Installed hashicorp/aws v6.30.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (1 to add, 1 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dashboard_website will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dashboard_website" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prm-service-dashboard-dev/*",
            ]
          + sid       = "AllowCloudFrontRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::343515223843:distribution/ES60SAUQ8ZFXZ",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.dashboard_s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "dashboard_s3_distribution" {
        id                              = "ES60SAUQ8ZFXZ"
      ~ price_class                     = "PriceClass_All" -> "PriceClass_100"
        tags                            = {
            "ApplicationRole"     = "AwsCloudfrontDistribution"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-GP2GP-service-dashboard"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "Y"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (23 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::343515223843:function/rewrite-index-html"
            }

            # (2 unchanged blocks hidden)
        }

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "prm-service-dashboard-dev.s3.eu-west-2.amazonaws.com" -> null
          - origin_id                   = "prm-service-dashboard-dev" -> null
          - response_completion_timeout = 0 -> null
            # (2 unchanged attributes hidden)
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "prm-service-dashboard-dev.s3.eu-west-2.amazonaws.com"
          + origin_access_control_id    = "E2OQ2VSHLUFC7V"
          + origin_id                   = "prm-service-dashboard-dev"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)

          + s3_origin_config {
                # (1 unchanged attribute hidden)
            }
        }

      ~ restrictions {
          ~ geo_restriction {
              ~ locations        = [
                  + "GB",
                ]
              ~ restriction_type = "none" -> "whitelist"
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_policy.dashboard_website will be created
  + resource "aws_s3_bucket_policy" "dashboard_website" {
      + bucket = "prm-service-dashboard-dev"
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "eu-west-2"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>